import 'package:flutter/material.dart';

class data {
  static List shyri_Image = [
    "asset/images/bearbar.png",
    "asset/images/bestwishesh.png",
    "asset/images/bewfa.png",
    "asset/images/birthday.png",
    "asset/images/boyfriendgirl.png",
    "asset/images/child.png",
    "asset/images/god.png",
    "asset/images/holiimg.jpg",
    "asset/images/husband.png",
    "asset/images/kanjoos.png",
    "asset/images/love.png",
    "asset/images/married.png",
    "asset/images/motivational.png",
    "asset/images/officework.png",
    "asset/images/politics.png",
    "asset/images/sad.png",
    "asset/images/santabanta.png"
  ];
  static List shyri_typ = [
    "शुभकामना शायरी",
    "दोस्ती शायरी",
    "मजेदार शायरी",
    "भगवान शायरी",
    "प्रेरणा स्त्रोत शायरी",
    "जीवन शायरी",
    "मोहबत शायरी",
    "यादे शायरी",
    "अन्य शायरी",
    "राजनीती शायरी",
    "प्रेम शायरी",
    "दर्द शायरी",
    "शराब शायरी",
    "बेवफा शायरी",
    "जन्मदिन शायरी",
    "होली शायरी"
  ];

  static List shubhkamna = [
    """सफर वही तक जहाँ तक तुम हो,
नज़र वही तक जहाँ तक तुम हो,
वैसे तो हज़ारों फूल खिलतें हैं गुलशन में मगर,
खुशबू वही तक जहाँ तक तुम हो।""",
    """तेरे नज़रों के तीर इतने शातिर है,
की पता ही नही चलता किस के खातिर हैं।""",
    """दूर रहकर भी जो समाया है,
मेरी रूह की गहराई में,
पास वालों पर वो शख्स,
कितना असर रखता होगा।
 """,
    """ वहां तक चले चलो जहाँ तक साथ मुमकिन है,
जहाँ हालात बदलेंगे वहां तुम भी बदल जाना।
""",
    """ मुझे उस जगह से भी मोहब्बत हो जाती है,
जहाँ बैठ कर एक बार तुम्हें सोच लेता हूँ।
""",
    """ मोहब्बत एक खुशबू है हमेशा साथ रहती है,
कोई इंसान तन्हाई में भी कभी तन्हा नहीं रहता।
""",
  ];
  static List dosti = [
    """नज़रो को तेरे प्यार से इंकार नही है,
अब मुझे किसी और का इंतज़ार नही है,
मैं खामोश हूँ तो वो वजूद है मेरा,
लेकिन तुम ये न समझना मुझे तुमसे प्यार नही है।""",
    """तक्यों किसी से इतना प्यार हो जाता है,
एक दिन का भी इंतज़ार दुष्वार हो जाता है,
अपने भी लगने लगते हैं पराये,
जब एक अजनबी पर एतवार हो जाता है।""",
    """ तेरे ख्याल से खुद को छुपा के देखा है,
दिल-ओ-नजर को रुला-रुला के देखा है,
तू नहीं तो कुछ भी नहीं है तेरी कसम,
मैंने कुछ पल तुझे भुला के देखा है।
""",
    """नहीं जो दिल में जगह तो नजर में रहने दो,
मेरी हयात को तुम अपने असर में रहने दो,
मैं अपनी सोच को तेरी गली में छोड़ आया हूँ,
मेरे वजूद को ख़्वाबों के घर में रहने दो।
 """,
    """ हमारे एक इशारे पर वो ऐसे मुसकुरा बैठे,
हम उनकी मुस्कराहट पे खुद को लुटा बैठे,
न समझे हैं न समझेंगे वो मोहब्बत को,
कि उनकी हर अदा पे हम खुद को मिटा बैठे।
""",
    """ किताब-ए-दिल में भी रखा तो ताज़गी ना गई,
तेरे ख्याल का जलवा गुलाब जैसा है।
""",
    """ तेरे ख्याल में जब बेख्याल होता हूँ,
जरा सी देर को ही सही बेमिसाल होता हूँ।
""",
  ];
  static List moj = [
    """ तू हकीकत-ए-इश्क है या कोई फरेब,
ज़िन्दगी में आती नहीं ख़्वाबों से जाती नहीं।
""",
    """ तेरा ज़िक्र तेरी फ़िक्र तेरा एहसास तेरा ख्याल,
तू खुदा तो नहीं फिर हर जगह क्यों है।""",
    """ रोज वो ख़्वाब में आते हैं गले मिलने को,
मैं जो सोता हूँ तो जाग उठती है किस्मत मेरी।""",
    """ तुम्हारा ज़र्फ़ है तुम को मोहब्बत भूल जाती है,
हमें तो जिस ने हँस कर भी पुकारा याद रहता है,
मोहब्बत में जो डूबा हो उसे साहिल से क्या लेना,
किसे इस बहर में जा कर किनारा याद रहता है।""",
    """ बेवजह हम वजह ढूंढ़ते हैं तेरे पास आने को,
ये दिल बेकरार है तुझे धड़कन में बसाने को,
बुझती नहीं है प्यास मेरे इस प्यासे दिल की,
न जाने कब मिलेगा सुकून तेरे इस दीवाने को।
""",
    """होठों पर मोहब्बत के फ़साने नहीं आते,
साहिल पर समंदर के खजाने नहीं आते,
पलकें भी चमक उठती हैं सोते हुए हमारी,
आँखों को अभी ख्वाब छुपाने नहीं आते।
 """,
    """ मोहब्बत एक खुशबू है हमेशा साथ रहती है,
कोई इंसान तन्हाई में भी कभी तन्हा नहीं रहता।
""",
  ];
  static List bhgvan = [
    """ दिल की आवाज़ को इज़हार कहते हैं,
झुकी हुयी निगाह को इकरार कहते हैं,
सिर्फ पाने का नाम ही इश्क नहीं,
कुछ खोने को भी प्यार कहते हैं।
""",
    """ हाल तो पूछ लूँ तेरा पर डरता हूँ आवाज़ से तेरी,
जब जब सुनी है कमबख्त मोहब्बत ही हुई है।""",
    """कुछ लिख नहीं पाते कुछ सुना नहीं पाते,
हाल-ए-दिल जुबान पर ला नहीं पाते,
वो उतर गए हैं दिल की गहराइयों में,
वो समझ नहीं पाते और हम समझा नहीं पाते।
 """,
    """ दो चार लफ्ज़ प्यार के लेकर हम क्या करेंगे,
देनी है तो वफ़ा की मुकम्मल किताब दे दो|""",
    """आँखें तो प्यार में दिल की ज़ुबान होती है,
सच्ची चाहत तो सदा बे-ज़ुबान होती है,
प्यार में दर्द भी मिले तो क्या घबराना,
सुना है दर्द से ही चाहत और जवान होती है।
 """,
  ];
  static List prenna = [
    """अकेले हम ही शामिल नहीं हैं इस जुर्म में,
नजर जब मिली थी मुस्कराये तुम भी थे।

 """,
    """दुनिया तेरे वजूद को करती रही तलाश,
हमने तेरे ख्याल को दुनिया बना लिया।

 """,
    """जिस तरह रगों में खून रहता है,
इस तरह तेरी चाहत का जुनून रहता है,
ज़िंदगी की हर ख़ुशी मंसूब है तुमसे,
बात हो तुमसे तो दिल को सुकून रहता है।

 """,
    """ प्यार का कोई रंग नहीं फिर भी वो रंगीन है,
इसका कोई चेहरा नहीं फिर भी वो हसीन हैं।

""",
    """हम फिर उनके रूठ जाने पर फ़िदा होने लगे,
हमें फिर प्यार आ गया जब वो ख़फ़ा होने लगे।
 """,
  ];
  static List jivan = [
    """अरमान कोई सीने में आग लगा देता है,
एक ख्वाब आकर रातों को नींद उड़ा देता है,
पूछता हूँ जिस से भी मंजिल का पता मैं,
हर कोई रस्ता तेरे घर का बता देता है। """,
    """ उतर जाते है कुछ लोग दिल में इस कदर,
जिनको दिल से निकालो तो जान निकल जाती है।
""",
    """तुम मुझे एक मौका तो दो ऐतबार बनाने का,
थक जाओगे मेरी वफाओं के साथ चलते चलते
 """,
    """अब ना मैं हूँ, ना बाकी हैं ज़माने मेरे,
फिर भी मशहूर हैं शहरों में फ़साने मेरे,
ज़िन्दगी है तो नए ज़ख्म भी लग जाएंग,
अब भी बाकी हैं कई दोस्त पुराने मेरे।
 """,
    """ तेरी हर बात मोहब्बत में गँवारा करके,
दिल के बाज़ार में बैठे हैं खसारा करके,
मैं वो दरिया हूँ कि हर बूंद भंवर है जिसकी,
तुमने अच्छा ही किया मुझसे किनारा करके"""
  ];
  static List mohabt = [
    """  लू भी चलती थी तो बादे-शबा कहते थे,
  पांव फैलाये अंधेरो को दिया कहते थे,
  उनका अंजाम तुझे याद नही है शायद,
  और भी लोग थे जो खुद को खुदा कहते थे।"""
    ,
    """चेहरों के लिए आईने कुर्बान किये हैं,
  इस शौक में अपने बड़े नुकसान किये हैं,
  महफ़िल में मुझे गालियाँ देकर है बहुत खुश,
  जिस शख्स पर मैंने बड़े एहसान किये है।"""
    ,
    """  हाथ ख़ाली हैं तेरे शहर से जाते जाते,
  जान होती तो मेरी जान लुटाते जाते,
  अब तो हर हाथ का पत्थर हमें पहचानता है,
  उम्र गुज़री है तेरे शहर में आते जाते।"""
    ,
    """ आँख में पानी रखो होंटों पे चिंगारी रखो,
  ज़िंदा रहना है तो तरकीबें बहुत सारी रखो,
  एक ही नदी के हैं ये दो किनारे दोस्तो,
  दोस्ताना ज़िंदगी से मौत से यारी रखो।
"""
  ];
  static List yade = [
    """ रोज़ तारों को नुमाइश में ख़लल पड़ता है,
  चाँद पागल है अँधेरे में निकल पड़ता है,
  रोज़ पत्थर की हिमायत में ग़ज़ल लिखते हैं,
  रोज़ शीशों से कोई काम निकल पड़ता है।"""
    ,
    """आँख में पानी रखो होंटों पे चिंगारी रखो,
  ज़िंदा रहना है तो तरकीबें बहुत सारी रखो,
  एक ही नदी के हैं ये दो किनारे दोस्तो,
  दोस्ताना ज़िंदगी से मौत से यारी रखो।
""","""
  अजीब लोग हैं मेरी तलाश में मुझको,
  वहाँ पर ढूंढ रहे हैं जहाँ नहीं हूँ मैं,
  मैं आईनों से तो मायूस लौट आया था,
  मगर किसी ने बताया बहुत हसीं हूँ मैं।
""","""
  बहुत गुरूर है दरिया को अपने होने पर,
  जो मेरी प्यास से उलझे तो धज्जियाँ उड़ जाएँ।
""","""
  मैंने अपनी खुश्क आँखों से लहू छलका दिया,
  इक समंदर कह रहा था मुझको पानी चाहिए।
 """
  ];
  static List any = [
    """ उसे अब के वफ़ाओं से गुजर जाने की जल्दी थी,
  मगर इस बार मुझ को अपने घर जाने की जल्दी थी,
  मैं आखिर कौन सा मौसम तुम्हारे नाम कर देता,
  यहाँ हर एक मौसम को गुजर जाने की जल्दी थी।
""","""
  आजकल पुलिस वालों को देखते ही उन औरतों की याद आ जाती है,
  जो जेठ को देखते ही घूंघट कार्ड लेती है।
""","""
  मेरे ग्रुप को ऐसे लोग तुरंत छोड़ दें,
  जो जेब में तानसेन होते हुए भी दूसरे से तानसेन मांग रहे हो
""","""
  अगर तुम थप्पड़ नहीं मार सकते तो,
  ताना ही मार के काम चला ले,
  लेकिन हाथ से मौका कभी जाने मत दो।
""","""
  मैंने कुछ दिन चुप रह कर देखा,
  लेकिन लोग भाग तो सच में ही भूल जाते हैं।
""","""
  आज तो मेरा दिल बहुत ही अच्छा है कोई भी लड़की अपना मोबाइल
  रिचार्ज करवाना चाहती हो, तो मुझे अपना नंबर दे सकती है।
""","""
  प्यार है तो इंतजार कर पगली,
  हम लैला-मजनू थोड़ी है जो तेरी ख़ातिर मर जाऊँगा।
  """
  ];
  static List rajniti = [
    """ लड़कियाँ तो खूब पट जाती है लेकिन जिसको मन चाहता है वही नखरे दिखाती है
""",
    """अगर तुम जिस लड़की को पा नहीं सकते तुमसे आए..
आई लव यू बोलकर ब्लॉक कर दो। """
    ,        """ दोस्ती का रिश्ता भी कितना अजीब होता है,
मिल जाये तो बातें लंबी और
बिछड जायें तो यादें लंबी।"""
    ,        """ दोस्ती अगर दूर भी होती है ,
तो भी ये कोहिनूर होती है।""",
    """नाम की दोस्ती काम की यारी,
दूसरों की तरह आदत नहीं है हमारी। """
  ];
  static List prem = [
    """ कौन कहता है दोस्ती बर्बाद करती हैं,
निभाने वाले मिल जाए
तो दुनिया याद रखती हैं।""",
    """ मोहब्बत हो तो कलम
और सियाही के जैसी हो,
और यारी हो तो शोले के
जय और वीरू जैसी हो।""",
    """भले ही मेरे दोस्त कम हैं,
पर जितने भी हैं एटम बम हैं। """,
    """दोस्ती कभी स्पेशल लोगो से नही होती है,
जिनसे दोस्ती हो जाती है
वह लोग ही स्पेशल हो जाते है। """,
    """मुझे पागलो से दोस्ती करना पसंद है साहब,
क्योंकि मुसीबत में कोई समझदार काम नहीं आता। """,
  ];
  static List dard = [
    """ बेशक दोस्त से फासला हो जाए,
मगर उसकी दोस्ती से फासला कभी मत करना।""",
    """ऐ खुदा अपनी अदालत मे मेरी ज़मानत रखना,
मैं रहूँ या ना रहूँ मेरे दोस्तो को सलामत रखना।  """,
    """जब भी मेरे दोस्त आ जाते है,
गम के मेरे आंसू ख़ुशी में बदल जाते है। """,
    """तेरे आते ही दोस्त महफ़िल सजने लगती है,
और बेरंग ज़िंदगी भी रंगने लगती है। """,
    """ दो ऊँगली जोड़ने से दोस्ती हो जाती है ,
यही तो दोस्ती की ख़ूबसूरती कहलाती है।""",
  ];
  static List shrab = [
    """ खूबिया मिलती है तो शादी होती है,
मगर कमिया मिलती है तो दोस्ती होती है।""",
    """ ए दोस्त तेरी दोस्ती पर हम फक्र करते है,
तू सलामत रहे इस जहां में
यही दुआ हम रब से करते है।""",
    """ ना तुम दूर जाना ना हम दूर जाएंगे ,
अपने-अपने हिस्से की दोस्ती हम निभाएंगे।""",
    """ दोस्तों ने अपना फ़र्ज़ कुछ इस तरह निभाया है,
कि मैं भूखा रहा तो दोस्तों ने भी ना खाया है।""",
    """ जब दोस्त नहीं हो तो कुत्ते भी सताते हैं,
और एक ही कमीना दोस्त साथ हो
तो शेर भी घबराते हैं।""",
  ];
  static List bevfa = [
    """ न जाने कौन सी दौलत है
कुछ दोस्तों के लफ्जों में,
बात करते हैं तो दिल ही खरीद लेते हैं।""",
    """ दोस्त को दौलत की निगाह से मत देखो,
वफा करने वाले दोस्त अक्सर गरीब हुआ करते हैं।""",
    """ दोस्तो के बिना जिंदगी मुश्किल लगती है,
दोस्तो के साथ होने से ही
जिंदगी में खुशी मिलती है।""",
    """छोटी सी जिंदगी में
कुछ दोस्त हमे ऐसे मिल गए,
कुछ दिल में उतर गए
तो कुछ दिल से उतर गए। """,
    """ कुछ दोस्त सीधे साधे भी अच्छे नही लगते,
और कुछ कमीने जान से भी प्यारे होते है।""",
  ];
  static List janmdin = [
    """ दुश्मन के सितम का खौफ नही हमको,
हम तो दोस्तो के रूठ जाने से डरते है।""",
    """ इक तेरी ख्वाहिश है बस,
कायनात किसने मांगी है.""",
    """तरस आता है मुझे अपनी मासूम सी पलकों पर,
जब भीगकर कहती है की अब रोया नहीं जाता. """,
    """ इंसान के किरदार की दो ही मंजिलें हैं,
दिल में उतर जाना या दिल से उतर जाना""",
    """ सुबह रंगीली शाम रंगीली ऐसी आयी है ये होली
सब पर बरसे रंग कई पर मेरी खाली थी झोली
""",
  ];
  static List holi = [
    """ दिन रंगीन, रंगीली रात दिल में रह गयी दिल की बात
  कैसे सह पाऊ मैं पगली मिले जो मुझको कई आघात
""","""
  जब भी आती देखी होली रात अँधेरी मुझको बोली
  सुबह के रंग में रंग दूंगी तुझको पर सुबह ने आँख न खोली
""","""
  होली आयी और चली गयी,सब की दुनिया रंगी गयी
  मैं मासूम लिए दिल अपना जाने कितनी बार चली गयी
""","""
  रंग में उमंग नहीं थी खुशियो की कोई भांग नहीं थी
  ऐसी थी तक़दीर मेरी की,होली की कोई हुड़ंग नही थी
  romantic Holi Shayari In Hindi For Girlfriend
""",""" तेरी चाहत का रंग चढ़ा है मुझ पर
वो उतरे तो खेलूं होली......😍"""
    ,"""मोहब्बत की सबसे बडी खामी ये है
की बरसो गुजर जाने के बाद भी मोहब्बत रहती है """,
    """
लोग कहते हैं बिन देखे कुछ महसूस नहीं होता,
हम तो बिन देखे तुझे हर पल हर लम्हा महसूस करते हैं
"""
  ];

  static List g_color = [
    [Colors.amber,Colors.red,Colors.blue],
    [Colors.purple,Colors.red,Colors.brown],
    [Colors.red,Colors.blue,Colors.green],
    [Colors.blue,Colors.red,Colors.cyan],
    [Colors.orange,Colors.lightGreen,Colors.pink],
    [Colors.deepPurple,Colors.pink]
  ];


}
